blog/_posts/2013-11/2013-11-19-openstack-havana-deploy.html
---
layout: post
keywords: 
description: 
title: openstack havana all-in-one部署 
categories: [openstack]
tags: [openstack,havana]
group: archive
icon: compass
featured: false
---

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 部署环境</a></li>
<li><a href="#sec-2">2 初始网卡配置</a></li>
<li><a href="#sec-3">3 添加havana源</a></li>
<li><a href="#sec-4">4 安装mysql和rabbitmq</a></li>
<li><a href="#sec-5">5 安装和配置Keystone</a>
<ul>
<li><a href="#sec-5-1">5.1 安装</a></li>
<li><a href="#sec-5-2">5.2 删除默认keystone的sqlite db 文件</a></li>
<li><a href="#sec-5-3">5.3 创建数据库</a></li>
<li><a href="#sec-5-4">5.4 修改配置文件</a>
<ul>
<li><a href="#sec-5-4-1">5.4.1 配置认证服务与其它服务的token认证</a></li>
<li><a href="#sec-5-4-2">5.4.2 同步keystone表数据到db中并重启keystone</a></li>
</ul>
</li>
<li><a href="#sec-5-5">5.5 创建tenant、user、roles</a>
<ul>
<li><a href="#sec-5-5-1">5.5.1 首先创建两个环境变量</a></li>
<li><a href="#sec-5-5-2">5.5.2 创建admin和service两个租户</a></li>
<li><a href="#sec-5-5-3">5.5.3 创建用户admin，密码password</a></li>
<li><a href="#sec-5-5-4">5.5.4 创建角色admin</a></li>
<li><a href="#sec-5-5-5">5.5.5 关联用户、角色、租户</a></li>
</ul>
</li>
<li><a href="#sec-5-6">5.6 创建Services 及 API endpoints</a></li>
<li><a href="#sec-5-7">5.7 验证认证服务(Keystone)安装是否成功</a></li>
</ul>
</li>
<li><a href="#sec-6">6 安装和配置glance</a>
<ul>
<li><a href="#sec-6-1">6.1 安装</a></li>
<li><a href="#sec-6-2">6.2 创建 glance 数据库</a></li>
<li><a href="#sec-6-3">6.3 修改glance配置文件</a></li>
<li><a href="#sec-6-4">6.4 同步数据库</a></li>
<li><a href="#sec-6-5">6.5 创建名为glance的认证用户</a></li>
<li><a href="#sec-6-6">6.6 创建service服务和endpoint</a></li>
<li><a href="#sec-6-7">6.7 重启glance服务</a></li>
<li><a href="#sec-6-8">6.8 上传镜像</a></li>
</ul>
</li>
<li><a href="#sec-7">7 安装和配置nova</a>
<ul>
<li><a href="#sec-7-1">7.1 安装计算服务</a></li>
<li><a href="#sec-7-2">7.2 修复guestfs的一个bug</a></li>
<li><a href="#sec-7-3">7.3 删除默认nova的sqlite db文件</a></li>
<li><a href="#sec-7-4">7.4 创建数据库</a></li>
<li><a href="#sec-7-5">7.5 修改配置文件</a></li>
<li><a href="#sec-7-6">7.6 创建用户与角色</a></li>
<li><a href="#sec-7-7">7.7 创建service服务和endpoint</a></li>
<li><a href="#sec-7-8">7.8 重启nova服务</a></li>
</ul>
</li>
<li><a href="#sec-8">8 安装和配置neutron</a></li>
<li><a href="#sec-9">9 其他</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">部署环境</h2>
<div class="outline-text-2" id="text-1">

<p>64位ubuntu-12.04.3-server系统 <br/>
双网卡
</p><ul>
<li>外网eth0 192.168.150.8/24
</li>
<li>内网eth1 172.16.0.254/24
</li>
</ul>

<p>双硬盘
</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">初始网卡配置</h2>
<div class="outline-text-2" id="text-2">

<p>为eth0和eth1配置IP
</p>


<pre class="example"># cat /etc/network/interfaces
auto lo
iface lo inet loopback

auto eth0
iface eth0 inet static
address 192.168.150.8
netmask 255.255.255.0
gateway 192.168.150.1
dns-nameservers 8.8.8.8

auto eth1
iface eth1 inet static
        address 172.16.0.254
        netmask 255.255.255.0
</pre>


<p>
#重启网络
/etc/init.d/networking restart
</p></div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">添加havana源</h2>
<div class="outline-text-2" id="text-3">




<pre class="example">#apt-get install ubuntu-cloud-keyring
#echo deb http://ubuntu-cloud.archive.canonical.com/ubuntu precise-updates/havana main &gt;&gt; /etc/apt/sources.list.d/havana.list
#echo deb http://ubuntu-cloud.archive.canonical.com/ubuntu precise-proposed/havana main &gt;&gt; /etc/apt/sources.list.d/havana.list
apt-get install python-software-properties
add-apt-repository cloud-archive:havana
apt-get update &amp;&amp; apt-get dist-upgrade
</pre>

</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">安装mysql和rabbitmq</h2>
<div class="outline-text-2" id="text-4">




<pre class="example">#设置mysql root用户密码为123456
echo mysql-server-5.5 mysql-server/root_password password 123456 | debconf-set-selections
echo mysql-server-5.5 mysql-server/root_password_again password 123456 | debconf-set-selections
apt-get -y install mysql-server python-mysqldb
#允许外部访问mysql
sed -i -e  "s/^\(bind-address\s*=\).*/\1 0.0.0.0/" /etc/mysql/my.cnf
#重启mysql服务
/etc/init.d/mysql restart
apt-get -y install rabbitmq-server
</pre>

<p>
rabbitmq-server默认会创建一个用户，用户名密码均为guest，并允许任何人用guest用户和默认密码访问RabbitMQ server。
修改guest密码的命令
</p>


<pre class="example">rabbitmqctl change_password guest NEW_PASS
</pre>

</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">安装和配置Keystone</h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1">安装</h3>
<div class="outline-text-3" id="text-5-1">

<p>apt-get install -y keystone
</p></div>

</div>

<div id="outline-container-5-2" class="outline-3">
<h3 id="sec-5-2">删除默认keystone的sqlite db 文件</h3>
<div class="outline-text-3" id="text-5-2">




<pre class="example">rm -f /var/lib/keystone/keystone.sqlite
</pre>

</div>

</div>

<div id="outline-container-5-3" class="outline-3">
<h3 id="sec-5-3">创建数据库</h3>
<div class="outline-text-3" id="text-5-3">

<p>用户名和密码均为keystone
</p>


<pre class="example"># mysql -u root -p
mysql&gt; CREATE DATABASE keystone;
mysql&gt; GRANT ALL PRIVILEGES ON keystone.* TO 'keystone'@'localhost' \
IDENTIFIED BY 'keystone';
mysql&gt; GRANT ALL PRIVILEGES ON keystone.* TO 'keystone'@'%' \
IDENTIFIED BY 'keystone';
</pre>

</div>

</div>

<div id="outline-container-5-4" class="outline-3">
<h3 id="sec-5-4">修改配置文件</h3>
<div class="outline-text-3" id="text-5-4">


</div>

<div id="outline-container-5-4-1" class="outline-4">
<h4 id="sec-5-4-1">配置认证服务与其它服务的token认证</h4>
<div class="outline-text-4" id="text-5-4-1">

<p>openssk产生随机token
</p>


<pre class="example">openssl rand -hex 10
2c006f393f3775b503f4
</pre>

<p>
修改/etc/keystone/keystone.conf,[DEFAULT]admin<sub>token值替换为openssl产生的，</sub> 修改[sql]的connection.
</p>


<pre class="example">[DEFAULT]
admin_token = 2c006f393f3775b503f4
...
[sql]
# The SQLAlchemy connection string used to connect to the database
connection = mysql://keystone:keystone@172.16.0.254/keystone
...
</pre>

</div>

</div>

<div id="outline-container-5-4-2" class="outline-4">
<h4 id="sec-5-4-2">同步keystone表数据到db中并重启keystone</h4>
<div class="outline-text-4" id="text-5-4-2">




<pre class="example">keystone-manage db_sync
/etc/init.d/keystone restart
</pre>

</div>
</div>

</div>

<div id="outline-container-5-5" class="outline-3">
<h3 id="sec-5-5">创建tenant、user、roles</h3>
<div class="outline-text-3" id="text-5-5">


</div>

<div id="outline-container-5-5-1" class="outline-4">
<h4 id="sec-5-5-1">首先创建两个环境变量</h4>
<div class="outline-text-4" id="text-5-5-1">




<pre class="example">export OS_SERVICE_TOKEN=2c006f393f3775b503f4
export OS_SERVICE_ENDPOINT=http://172.16.0.254:35357/v2.0
</pre>

</div>

</div>

<div id="outline-container-5-5-2" class="outline-4">
<h4 id="sec-5-5-2">创建admin和service两个租户</h4>
<div class="outline-text-4" id="text-5-5-2">




<pre class="example">keystone tenant-create --name=admin --description="Admin Tenant"
keystone tenant-create --name=service --description="Service Tenant"
</pre>

</div>

</div>

<div id="outline-container-5-5-3" class="outline-4">
<h4 id="sec-5-5-3">创建用户admin，密码password</h4>
<div class="outline-text-4" id="text-5-5-3">




<pre class="example">keystone user-create --name=admin --pass=password \
--email=admin@126.com
</pre>

</div>

</div>

<div id="outline-container-5-5-4" class="outline-4">
<h4 id="sec-5-5-4">创建角色admin</h4>
<div class="outline-text-4" id="text-5-5-4">




<pre class="example">keystone role-create --name=admin
</pre>

</div>

</div>

<div id="outline-container-5-5-5" class="outline-4">
<h4 id="sec-5-5-5">关联用户、角色、租户</h4>
<div class="outline-text-4" id="text-5-5-5">




<pre class="example">keystone user-role-add --user=admin --tenant=admin --role=admin
</pre>

</div>
</div>

</div>

<div id="outline-container-5-6" class="outline-3">
<h3 id="sec-5-6">创建Services 及 API endpoints</h3>
<div class="outline-text-3" id="text-5-6">

<p>首先创建一个类型为identity的keystone服务，名称为keystone：
</p>


<pre class="example">keystone service-create --name=keystone --type=identity \
--description="Keystone Identity Service"
</pre>

<p>
创建endpoint
</p>


<pre class="example">keystone endpoint-create \
--service-id=the_service_id_above \
--publicurl=http://172.16.0.254:5000/v2.0 \
--internalurl=http://172.16.0.254:5000/v2.0 \
--adminurl=http://172.16.0.254:35357/v2.0
</pre>

</div>

</div>

<div id="outline-container-5-7" class="outline-3">
<h3 id="sec-5-7">验证认证服务(Keystone)安装是否成功</h3>
<div class="outline-text-3" id="text-5-7">

<p>先unset之前的环境变量：
</p>


<pre class="example">unset OS_SERVICE_TOKEN OS_SERVICE_ENDPOINT
</pre>

<p>
创建keystonerc文件(环境变量)
</p>


<pre class="example">cat &gt; keystonerc &lt;&lt; _EOF_
OS_USERNAME=admin
OS_PASSWORD=password
OS_TENANT_NAME=admin
OS_AUTH_URL=http://172.16.0.254:35357/v2.0
_EOF_
source keystonerc
</pre>

<p>
验证keystone是否正常
</p>


<pre class="example">keystone token
keystone user-list
keystone role-list
keystone tenant-list
keystone endpoint-list
</pre>

</div>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">安装和配置glance</h2>
<div class="outline-text-2" id="text-6">


</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1">安装</h3>
<div class="outline-text-3" id="text-6-1">




<pre class="example">apt-get install glance
</pre>

<p>
删除 glance sqlite 文件：
</p>


<pre class="example">rm -f /var/lib/glance/glance.sqlite
</pre>

</div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2">创建 glance 数据库</h3>
<div class="outline-text-3" id="text-6-2">

<p>用户名密码均为glance
</p>


<pre class="example">mysql -u root -p
mysql&gt; CREATE DATABASE glance;
mysql&gt; GRANT ALL PRIVILEGES ON glance.* TO 'glance'@'localhost' \
IDENTIFIED BY 'glance';
mysql&gt; GRANT ALL PRIVILEGES ON glance.* TO 'glance'@'%' \
IDENTIFIED BY 'glance';
</pre>

</div>

</div>

<div id="outline-container-6-3" class="outline-3">
<h3 id="sec-6-3">修改glance配置文件</h3>
<div class="outline-text-3" id="text-6-3">

<p>修改/etc/glance/glance-api.conf
</p>


<pre class="example">verbose = True
debug = True
sql_connection = mysql://glance:glance@172.16.0.254/glance
[keystone_authtoken]
auth_host = 172.16.0.254
auth_port = 35357
auth_protocol = http
admin_tenant_name = service
admin_user = glance
admin_password = glance
</pre>

<p>
修改/etc/glance/glance-registry.conf
</p>


<pre class="example">verbose = True
debug = True
sql_connection = mysql://glance:glance@172.16.0.254/glance
[keystone_authtoken]
auth_host = 172.16.0.254
auth_port = 35357
auth_protocol = http
admin_tenant_name = service
admin_user = glance
admin_password = glance
</pre>

</div>

</div>

<div id="outline-container-6-4" class="outline-3">
<h3 id="sec-6-4">同步数据库</h3>
<div class="outline-text-3" id="text-6-4">




<pre class="example">glance-manage db_sync
</pre>


</div>

</div>

<div id="outline-container-6-5" class="outline-3">
<h3 id="sec-6-5">创建名为glance的认证用户</h3>
<div class="outline-text-3" id="text-6-5">




<pre class="example">keystone user-create --name=glance --pass=glance \
--email=glance@126.com
keystone user-role-add --user=glance --tenant=service --role=admin
</pre>

<p>
配置/etc/glance/glance-api-paste.ini和/etc/glance/glance-registry-paste.ini.两个文件都修改[filter:authtoken]部分如下:
</p>


<pre class="example">[filter:authtoken]
paste.filter_factory=keystoneclient.middleware.auth_token:filter_factory
auth_host=172.16.0.254
admin_user=glance
admin_tenant_name=service
admin_password=glance
</pre>

</div>

</div>

<div id="outline-container-6-6" class="outline-3">
<h3 id="sec-6-6">创建service服务和endpoint</h3>
<div class="outline-text-3" id="text-6-6">




<pre class="example">keystone service-create --name=glance --type=image \
--description="Glance Image Service"
</pre>

<p>
记录下service id,下面创建endpoint要用到
</p>


<pre class="example">keystone endpoint-create \
--service-id=the_service_id_above \
--publicurl=http://172.16.0.254:9292 \
--internalurl=http://172.16.0.254:9292 \
--adminurl=http://172.16.0.254:9292
</pre>

</div>

</div>

<div id="outline-container-6-7" class="outline-3">
<h3 id="sec-6-7">重启glance服务</h3>
<div class="outline-text-3" id="text-6-7">




<pre class="example">service glance-registry restart
service glance-api restart
</pre>

</div>

</div>

<div id="outline-container-6-8" class="outline-3">
<h3 id="sec-6-8">上传镜像</h3>
<div class="outline-text-3" id="text-6-8">

<p>下载测试镜像
</p>


<pre class="example">wget http://cdn.download.cirros-cloud.net/0.3.1/cirros-0.3.1-x86_64-
disk.img
</pre>

<p>
上传
</p>


<pre class="example">glance image-create --name='cirros' --is-public true --container-format bare --disk-format qcow2 &lt; ./cirros-0.3.0-x86_64-disk.img
</pre>

<p>
查看上传的镜像
</p>


<pre class="example">glance image-list
</pre>

</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7">安装和配置nova</h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1">安装计算服务</h3>
<div class="outline-text-3" id="text-7-1">




<pre class="example">apt-get install nova-novncproxy novnc nova-api \
nova-ajax-console-proxy nova-cert nova-conductor \
nova-consoleauth nova-doc nova-scheduler
apt-get install nova-compute-kvm python-guestfs
</pre>

</div>

</div>

<div id="outline-container-7-2" class="outline-3">
<h3 id="sec-7-2">修复guestfs的一个bug</h3>
<div class="outline-text-3" id="text-7-2">




<pre class="example">chmod 0644 /boot/vmlinuz*
</pre>

</div>

</div>

<div id="outline-container-7-3" class="outline-3">
<h3 id="sec-7-3">删除默认nova的sqlite db文件</h3>
<div class="outline-text-3" id="text-7-3">




<pre class="example">rm -f /var/lib/keystone/nova.sqlite
</pre>

</div>

</div>

<div id="outline-container-7-4" class="outline-3">
<h3 id="sec-7-4">创建数据库</h3>
<div class="outline-text-3" id="text-7-4">




<pre class="example">mysql -u root -p
mysql&gt; CREATE DATABASE nova;
mysql&gt; GRANT ALL PRIVILEGES ON nova.* TO 'nova'@'localhost' \
IDENTIFIED BY 'nova';
mysql&gt; GRANT ALL PRIVILEGES ON nova.* TO 'nova'@'%' \
IDENTIFIED BY 'nova';
</pre>

</div>

</div>

<div id="outline-container-7-5" class="outline-3">
<h3 id="sec-7-5">修改配置文件</h3>
<div class="outline-text-3" id="text-7-5">

<p>修改/etc/nova/nova.conf
</p>


<pre class="example">[DEFAULT]
my_ip=192.168.150.8
vncserver_listen=0.0.0.0
vncserver_proxyclient_address=172.16.0.254
novncproxy_base_url=http://192.168.150.8:6080/vnc_auto.html
auth_strategy=keystone
rpc_backend = nova.rpc.impl_kombu
rabbit_host = 172.16.0.254
glance_host = 172.16.0.254
[database]
connection = mysql://nova:nova@172.16.0.254/nova
</pre>

<p>
修该/etc/nova/api-paste.ini的[filter:authtoken]部分
</p>


<pre class="example">[filter:authtoken]
paste.filter_factory=keystoneclient.middleware.auth_token:filter_factory
auth_host=172.16.0.254
auth_port = 35357
auth_protocol = http
auth_uri=http://172.16.0.254:5000
admin_tenant_name=service
admin_user=nova
admin_password=nova
</pre>

</div>

</div>

<div id="outline-container-7-6" class="outline-3">
<h3 id="sec-7-6">创建用户与角色</h3>
<div class="outline-text-3" id="text-7-6">




<pre class="example">keystone user-create --name=nova --pass=nova --email=nova@126.
com
keystone user-role-add --user=nova --tenant=service --role=admin
</pre>

</div>

</div>

<div id="outline-container-7-7" class="outline-3">
<h3 id="sec-7-7">创建service服务和endpoint</h3>
<div class="outline-text-3" id="text-7-7">




<pre class="example">keystone service-create --name=nova --type=compute \
--description="Nova Compute service"
</pre>

<p>
记下service id
</p>


<pre class="example">keystone endpoint-create \
--service-id=the_service_id_above \
--publicurl=http://172.16.0.254:8774/v2/%\(tenant_id\)s \
--internalurl=http://172.16.0.254:8774/v2/%\(tenant_id\)s \
--adminurl=http://172.16.0.254:8774/v2/%\(tenant_id\)s
</pre>

</div>

</div>

<div id="outline-container-7-8" class="outline-3">
<h3 id="sec-7-8">重启nova服务</h3>
<div class="outline-text-3" id="text-7-8">

<p>同步数据
</p>


<pre class="example">nova-manage db sync
</pre>

<p>
重启服务
</p>


<pre class="example">cd /etc/init.d/; for i in $( ls nova-* ); do sudo service $i restart; done
</pre>

<p>
测试nova是否安装正常
</p>


<pre class="example">nova image-list
</pre>

</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8">安装和配置neutron</h2>
<div class="outline-text-2" id="text-8">

</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9">其他</h2>
<div class="outline-text-2" id="text-9">

<p>hostname
</p>
<p>
ntp
</p>
</div>
</div>
